Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f17174.h
// Register: PWM4PR
#define PWM4PR PWM4PR
extern volatile unsigned short          PWM4PR              __at(0xA0F);
#ifndef _LIB_BUILD
asm("PWM4PR equ 0A0Fh");
#endif

// Register: PWM4PRL
#define PWM4PRL PWM4PRL
extern volatile unsigned char           PWM4PRL             __at(0xA0F);
#ifndef _LIB_BUILD
asm("PWM4PRL equ 0A0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRL                    :8;
    };
} PWM4PRLbits_t;
extern volatile PWM4PRLbits_t PWM4PRLbits __at(0xA0F);
// bitfield macros
#define _PWM4PRL_PRL_POSN                                   0x0
#define _PWM4PRL_PRL_POSITION                               0x0
#define _PWM4PRL_PRL_SIZE                                   0x8
#define _PWM4PRL_PRL_LENGTH                                 0x8
#define _PWM4PRL_PRL_MASK                                   0xFF

// Register: PWM4PRH
#define PWM4PRH PWM4PRH
extern volatile unsigned char           PWM4PRH             __at(0xA10);
#ifndef _LIB_BUILD
asm("PWM4PRH equ 0A10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRH                    :8;
    };
} PWM4PRHbits_t;
extern volatile PWM4PRHbits_t PWM4PRHbits __at(0xA10);
// bitfield macros
#define _PWM4PRH_PRH_POSN                                   0x0
#define _PWM4PRH_PRH_POSITION                               0x0
#define _PWM4PRH_PRH_SIZE                                   0x8
#define _PWM4PRH_PRH_LENGTH                                 0x8
#define _PWM4PRH_PRH_MASK                                   0xFF

// Register: PWM4CPRE
#define PWM4CPRE PWM4CPRE
extern volatile unsigned char           PWM4CPRE            __at(0xA11);
#ifndef _LIB_BUILD
asm("PWM4CPRE equ 0A11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPRE                   :8;
    };
} PWM4CPREbits_t;
extern volatile PWM4CPREbits_t PWM4CPREbits __at(0xA11);
// bitfield macros
#define _PWM4CPRE_CPRE_POSN                                 0x0
#define _PWM4CPRE_CPRE_POSITION                             0x0
#define _PWM4CPRE_CPRE_SIZE                                 0x8
#define _PWM4CPRE_CPRE_LENGTH                               0x8
#define _PWM4CPRE_CPRE_MASK                                 0xFF

// Register: PWM4PIPOS
#define PWM4PIPOS PWM4PIPOS
extern volatile unsigned char           PWM4PIPOS           __at(0xA12);
#ifndef _LIB_BUILD
asm("PWM4PIPOS equ 0A12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIPOS                  :8;
    };
} PWM4PIPOSbits_t;
extern volatile PWM4PIPOSbits_t PWM4PIPOSbits __at(0xA12);
// bitfield macros
#define _PWM4PIPOS_PIPOS_POSN                               0x0
#define _PWM4PIPOS_PIPOS_POSITION                           0x0
#define _PWM4PIPOS_PIPOS_SIZE                               0x8
#define _PWM4PIPOS_PIPOS_LENGTH                             0x8
#define _PWM4PIPOS_PIPOS_MASK                               0xFF

// Register: PWM4GIR
#define PWM4GIR PWM4GIR
extern volatile unsigned char           PWM4GIR             __at(0xA13);
#ifndef _LIB_BUILD
asm("PWM4GIR equ 0A13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1                   :1;
        unsigned S1P2                   :1;
    };
    struct {
        unsigned S1P1IF                 :1;
        unsigned S1P2IF                 :1;
    };
} PWM4GIRbits_t;
extern volatile PWM4GIRbits_t PWM4GIRbits __at(0xA13);
// bitfield macros
#define _PWM4GIR_S1P1_POSN                                  0x0
#define _PWM4GIR_S1P1_POSITION                              0x0
#define _PWM4GIR_S1P1_SIZE                                  0x1
#define _PWM4GIR_S1P1_LENGTH                                0x1
#define _PWM4GIR_S1P1_MASK                                  0x1
#define _PWM4GIR_S1P2_POSN                                  0x1
#define _PWM4GIR_S1P2_POSITION                              0x1
#define _PWM4GIR_S1P2_SIZE                                  0x1
#define _PWM4GIR_S1P2_LENGTH                                0x1
#define _PWM4GIR_S1P2_MASK                                  0x2
#define _PWM4GIR_S1P1IF_POSN                                0x0
#define _PWM4GIR_S1P1IF_POSITION                            0x0
#define _PWM4GIR_S1P1IF_SIZE                                0x1
#define _PWM4GIR_S1P1IF_LENGTH                              0x1
#define _PWM4GIR_S1P1IF_MASK                                0x1
#define _PWM4GIR_S1P2IF_POSN                                0x1
#define _PWM4GIR_S1P2IF_POSITION                            0x1
#define _PWM4GIR_S1P2IF_SIZE                                0x1
#define _PWM4GIR_S1P2IF_LENGTH                              0x1
#define _PWM4GIR_S1P2IF_MASK                                0x2

// Register: PWM4GIE
#define PWM4GIE PWM4GIE
extern volatile unsigned char           PWM4GIE             __at(0xA14);
#ifndef _LIB_BUILD
asm("PWM4GIE equ 0A14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1                   :1;
        unsigned S1P2                   :1;
    };
    struct {
        unsigned S1P1IE                 :1;
        unsigned S1P2IE                 :1;
    };
} PWM4GIEbits_t;
extern volatile PWM4GIEbits_t PWM4GIEbits __at(0xA14);
// bitfield macros
#define _PWM4GIE_S1P1_POSN                                  0x0
#define _PWM4GIE_S1P1_POSITION                              0x0
#define _PWM4GIE_S1P1_SIZE                                  0x1
#define _PWM4GIE_S1P1_LENGTH                                0x1
#define _PWM4GIE_S1P1_MASK                                  0x1
#define _PWM4GIE_S1P2_POSN                                  0x1
#define _PWM4GIE_S1P2_POSITION                              0x1
#define _PWM4GIE_S1P2_SIZE                                  0x1
#define _PWM4GIE_S1P2_LENGTH                                0x1
#define _PWM4GIE_S1P2_MASK                                  0x2
#define _PWM4GIE_S1P1IE_POSN                                0x0
#define _PWM4GIE_S1P1IE_POSITION                            0x0
#define _PWM4GIE_S1P1IE_SIZE                                0x1
#define _PWM4GIE_S1P1IE_LENGTH                              0x1
#define _PWM4GIE_S1P1IE_MASK                                0x1
#define _PWM4GIE_S1P2IE_POSN                                0x1
#define _PWM4GIE_S1P2IE_POSITION                            0x1
#define _PWM4GIE_S1P2IE_SIZE                                0x1
#define _PWM4GIE_S1P2IE_LENGTH                              0x1
#define _PWM4GIE_S1P2IE_MASK                                0x2

